src/DataProcessors/ТестовоеЗаполнениеСклада/ТестовоеЗаполнениеСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТестовоеЗаполнениеСклада</name>
</mdclass:DataProcessor>

src/AccumulationRegisters/ОстаткиНаСкладах/ОстаткиНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПриходТовара/ПриходТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходТовара</name>
  <registerRecords>AccumulationRegister.ОстаткиНаСкладах</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/РасходТовара/РасходТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходТовара</name>
  <registerRecords>AccumulationRegister.ОстаткиНаСкладах</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ТестовоеЗаполнениеСклада/ObjectModule.bsl
#Область ОбработчикиСобытий

// Точка входа обработки. Создаёт тестовые склады, номенклатуру,
// документы поступления и расхода, проводит их и выводит итоговые остатки.
Процедура Заполнить() Экспорт

	Сообщить("=== Начало заполнения тестовых данных ===");

	Склад1 = ПолучитьСклад("ТЕСТ — Основной склад");
	Склад2 = ПолучитьСклад("ТЕСТ — Резервный склад");
	Склад3 = ПолучитьСклад("ТЕСТ — Магазин");
	Сообщить("Склады: ОК");

	БумагаА4    = ПолучитьНоменклатуру("ТЕСТ — Бумага А4");
	РучкаСиняя  = ПолучитьНоменклатуру("ТЕСТ — Ручка синяя");
	Карандаш    = ПолучитьНоменклатуру("ТЕСТ — Карандаш");
	Тетрадь     = ПолучитьНоменклатуру("ТЕСТ — Тетрадь");
	Папка       = ПолучитьНоменклатуру("ТЕСТ — Папка");
	Скрепки     = ПолучитьНоменклатуру("ТЕСТ — Скрепки");
	Маркер      = ПолучитьНоменклатуру("ТЕСТ — Маркер");
	Степлер     = ПолучитьНоменклатуру("ТЕСТ — Степлер");
	Сообщить("Номенклатура: ОК");

	БазоваяДата = НачалоДня(ТекущаяДатаСеанса());

	СтрокиП1 = Новый Массив;
	СтрокиП1.Добавить(Новый Структура(КлючиСтрокиТовары(), БумагаА4,   100));
	СтрокиП1.Добавить(Новый Структура(КлючиСтрокиТовары(), РучкаСиняя, 50));
	СтрокиП1.Добавить(Новый Структура(КлючиСтрокиТовары(), Карандаш,   80));
	СтрокиП1.Добавить(Новый Структура(КлючиСтрокиТовары(), Тетрадь,    40));
	СоздатьПоступление("ТЕСТ-Поступление-1", БазоваяДата,         Склад1, СтрокиП1);

	СтрокиП2 = Новый Массив;
	СтрокиП2.Добавить(Новый Структура(КлючиСтрокиТовары(), БумагаА4, 30));
	СтрокиП2.Добавить(Новый Структура(КлючиСтрокиТовары(), Папка,    25));
	СтрокиП2.Добавить(Новый Структура(КлючиСтрокиТовары(), Маркер,   20));
	СтрокиП2.Добавить(Новый Структура(КлючиСтрокиТовары(), Степлер,  10));
	СоздатьПоступление("ТЕСТ-Поступление-2", БазоваяДата + 86400, Склад2, СтрокиП2);

	СтрокиП3 = Новый Массив;
	СтрокиП3.Добавить(Новый Структура(КлючиСтрокиТовары(), Тетрадь,    60));
	СтрокиП3.Добавить(Новый Структура(КлючиСтрокиТовары(), Скрепки,    100));
	СтрокиП3.Добавить(Новый Структура(КлючиСтрокиТовары(), РучкаСиняя, 25));
	СоздатьПоступление("ТЕСТ-Поступление-3", БазоваяДата + 172800, Склад3, СтрокиП3);
	Сообщить("Документы поступления: ОК");

	СтрокиР1 = Новый Массив;
	СтрокиР1.Добавить(Новый Структура(КлючиСтрокиТовары(), БумагаА4,   17));
	СтрокиР1.Добавить(Новый Структура(КлючиСтрокиТовары(), РучкаСиняя, 8));
	СтрокиР1.Добавить(Новый Структура(КлючиСтрокиТовары(), Карандаш,   12));
	СоздатьРасход("ТЕСТ-Расход-1", БазоваяДата + 259200, Склад1, СтрокиР1);

	СтрокиР2 = Новый Массив;
	СтрокиР2.Добавить(Новый Структура(КлючиСтрокиТовары(), БумагаА4, 5));
	СтрокиР2.Добавить(Новый Структура(КлючиСтрокиТовары(), Папка,    4));
	СтрокиР2.Добавить(Новый Структура(КлючиСтрокиТовары(), Маркер,   3));
	СоздатьРасход("ТЕСТ-Расход-2", БазоваяДата + 345600, Склад2, СтрокиР2);

	СтрокиР3 = Новый Массив;
	СтрокиР3.Добавить(Новый Структура(КлючиСтрокиТовары(), Тетрадь,    15));
	СтрокиР3.Добавить(Новый Структура(КлючиСтрокиТовары(), Скрепки,    20));
	СтрокиР3.Добавить(Новый Структура(КлючиСтрокиТовары(), РучкаСиняя, 5));
	СоздатьРасход("ТЕСТ-Расход-3", БазоваяДата + 432000, Склад3, СтрокиР3);
	Сообщить("Документы расхода: ОК");

	Сообщить("=== Итоговые остатки по тестовым складам ===");
	ВывестиОстаткиПоСкладу(Склад1, "ТЕСТ — Основной склад");
	ВывестиОстаткиПоСкладу(Склад2, "ТЕСТ — Резервный склад");
	ВывестиОстаткиПоСкладу(Склад3, "ТЕСТ — Магазин");
	Сообщить("=== Заполнение завершено ===");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает ключи структуры для строки табличной части Товары.
// Используется как параметр конструктора Структура, чтобы избежать дублирования литерала.
//
// Возвращаемое значение:
//  Строка - список ключей через запятую.
Функция КлючиСтрокиТовары()
	Возврат "Номенклатура, Количество";
КонецФункции

// Возвращает существующий склад по наименованию или создаёт новый.
//
// Параметры:
//  Наименование - Строка - наименование искомого/создаваемого склада.
// Возвращаемое значение:
//  СправочникСсылка.Склады - найденный или созданный склад.
Функция ПолучитьСклад(Наименование)

	НайденныйСклад = Справочники.Склады.НайтиПоНаименованию(Наименование, Истина);
	Если НайденныйСклад.Пустая() Тогда
		НовыйСклад = Справочники.Склады.СоздатьЭлемент();
		НовыйСклад.Наименование = Наименование;
		НовыйСклад.Записать();
		Сообщить("Создан склад: " + Наименование);
		Возврат НовыйСклад.Ссылка;
	КонецЕсли;
	Возврат НайденныйСклад;

КонецФункции

// Возвращает существующую номенклатуру по наименованию или создаёт новую.
//
// Параметры:
//  Наименование - Строка - наименование искомой/создаваемой номенклатуры.
// Возвращаемое значение:
//  СправочникСсылка.Номенклатура - найденная или созданная номенклатура.
Функция ПолучитьНоменклатуру(Наименование)

	НайденнаяНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Истина);
	Если НайденнаяНоменклатура.Пустая() Тогда
		НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наименование;
		НовыйЭлемент.Записать();
		Сообщить("Создана номенклатура: " + Наименование);
		Возврат НовыйЭлемент.Ссылка;
	КонецЕсли;
	Возврат НайденнаяНоменклатура;

КонецФункции

// Ищет документ ПриходТовара по уникальной метке в комментарии.
//
// Параметры:
//  Метка - Строка - уникальная подстрока комментария.
// Возвращаемое значение:
//  ДокументСсылка.ПриходТовара, Неопределено - найденный документ или Неопределено.
Функция НайтиПоступлениеПоМетке(Метка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПриходТовара.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходТовара КАК ПриходТовара
		|ГДЕ
		|	ПриходТовара.Комментарий ПОДОБНО &Метка";
	Запрос.УстановитьПараметр("Метка", "%" + Метка + "%");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// Ищет документ РасходТовара по уникальной метке в комментарии.
//
// Параметры:
//  Метка - Строка - уникальная подстрока комментария.
// Возвращаемое значение:
//  ДокументСсылка.РасходТовара, Неопределено - найденный документ или Неопределено.
Функция НайтиРасходПоМетке(Метка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РасходТовара.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходТовара КАК РасходТовара
		|ГДЕ
		|	РасходТовара.Комментарий ПОДОБНО &Метка";
	Запрос.УстановитьПараметр("Метка", "%" + Метка + "%");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// Создаёт и проводит документ ПриходТовара, если документа с такой меткой ещё нет.
//
// Параметры:
//  Метка - Строка - уникальный идентификатор документа.
//  Дата - Дата - дата документа.
//  Склад - СправочникСсылка.Склады - склад поступления.
//  МассивСтрок - Массив - массив структур {Номенклатура, Количество}.
Процедура СоздатьПоступление(Метка, Дата, Склад, МассивСтрок)

	Если НайтиПоступлениеПоМетке(Метка) <> Неопределено Тогда
		Сообщить("Документ " + Метка + " уже существует, пропускаем.");
		Возврат;
	КонецЕсли;

	Документ = Документы.ПриходТовара.СоздатьДокумент();
	Документ.Дата = Дата;
	Документ.Склад = Склад;
	Документ.Комментарий = "Автоматически создано для тестирования складской системы [" + Метка + "]";

	Для Каждого Строка Из МассивСтрок Цикл
		НоваяСтрока = Документ.Товары.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.Количество   = Строка.Количество;
	КонецЦикла;

	Документ.Записать(РежимЗаписиДокумента.Проведение);
	Сообщить("Создан и проведён документ " + Метка);

КонецПроцедуры

// Создаёт и проводит документ РасходТовара, если документа с такой меткой ещё нет.
//
// Параметры:
//  Метка - Строка - уникальный идентификатор документа.
//  Дата - Дата - дата документа.
//  Склад - СправочникСсылка.Склады - склад расхода.
//  МассивСтрок - Массив - массив структур {Номенклатура, Количество}.
Процедура СоздатьРасход(Метка, Дата, Склад, МассивСтрок)

	Если НайтиРасходПоМетке(Метка) <> Неопределено Тогда
		Сообщить("Документ " + Метка + " уже существует, пропускаем.");
		Возврат;
	КонецЕсли;

	Документ = Документы.РасходТовара.СоздатьДокумент();
	Документ.Дата = Дата;
	Документ.Склад = Склад;
	Документ.Комментарий = "Автоматически создано для тестирования складской системы [" + Метка + "]";

	Для Каждого Строка Из МассивСтрок Цикл
		НоваяСтрока = Документ.Товары.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.Количество   = Строка.Количество;
	КонецЦикла;

	Документ.Записать(РежимЗаписиДокумента.Проведение);
	Сообщить("Создан и проведён документ " + Метка);

КонецПроцедуры

// Выводит в окно сообщений остатки по указанному складу.
//
// Параметры:
//  Склад - СправочникСсылка.Склады - склад для отбора остатков.
//  ИмяСклада - Строка - имя склада для вывода в сообщении.
Процедура ВывестиОстаткиПоСкладу(Склад, ИмяСклада)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Номенклатура.Наименование КАК Номенклатура,
		|	Остатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиНаСкладах.Остатки(, Склад = &Склад) КАК Остатки
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
	Запрос.УстановитьПараметр("Склад", Склад);
	Выборка = Запрос.Выполнить().Выбрать();
	Сообщить("--- " + ИмяСклада + " ---");
	Если Выборка.Количество() = 0 Тогда
		Сообщить("  (нет остатков)");
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		Сообщить("  " + Выборка.Номенклатура + ": " + Выборка.Количество);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
